In [1]:
import pandas as pd
import numpy as np


# Read in csv
df = pd.read_csv("../data/Students_admission_records.csv")

In [2]:
df.head()

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
0,Shehroz,24.0,Female,50.0,68.90,Quetta,Rejected
1,Waqar,21.0,Female,99.0,60.73,Karachi,NaN
2,Bushra,17.0,Male,89.0,NaN,Islamabad,Accepted
3,Aliya,17.0,Male,55.0,85.29,Karachi,Rejected
4,Bilal,20.0,Male,65.0,61.13,Lahore,NaN

In [3]:
df.info()
df.columns

<class 'pandas.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    147 non-null    str
 1   Age                     147 non-null    float64
 2   Gender                  147 non-null    str
 3   Admission Test Score    146 non-null    float64
 4   High School Percentage  146 non-null    float64
 5   City                    147 non-null    str
 6   Admission Status        147 non-null    str
dtypes: float64(3), str(4)
memory usage: 8.7 KB

Index(['Name', 'Age', 'Gender', 'Admission Test Score',
       'High School Percentage', 'City', 'Admission Status'],
      dtype='str')

In [4]:
df = df.drop_duplicates()

In [5]:
df = df.drop(columns=["City", "Name"])

In [6]:
df.head()

    Age  Gender  Admission Test Score  High School Percentage Admission Status
0  24.0  Female                  50.0                   68.90         Rejected
1  21.0  Female                  99.0                   60.73              NaN
2  17.0    Male                  89.0                     NaN         Accepted
3  17.0    Male                  55.0                   85.29         Rejected
4  20.0    Male                  65.0                   61.13              NaN

In [7]:
df.info()

<class 'pandas.DataFrame'>
Index: 151 entries, 0 to 156
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Age                     141 non-null    float64
 1   Gender                  141 non-null    str
 2   Admission Test Score    140 non-null    float64
 3   High School Percentage  140 non-null    float64
 4   Admission Status        141 non-null    str
dtypes: float64(3), str(2)
memory usage: 7.1 KB

In [12]:
df["Admission Test Score"] = df["Admission Test Score"][(df["Admission Test Score"] >= 0) & (df["Admission Test Score"] <= 100)]
df["High School Percentage"] = df["High School Percentage"][(df["High School Percentage"] >= 0) & (df["High School Percentage"] <= 100)]

In [13]:
df.head(26)

,Age,Gender,Admission Test Score,High School Percentage,Admission Status
0,24.0,Female,50.0,68.90,Rejected
1,21.0,Female,99.0,60.73,NaN
2,17.0,Male,89.0,NaN,Accepted
3,17.0,Male,55.0,85.29,Rejected
4,20.0,Male,65.0,61.13,NaN
5,23.0,Female,NaN,NaN,Accepted
6,18.0,Male,NaN,97.31,Accepted
7,20.0,Female,82.0,55.67,Accepted
8,17.0,Male,64.0,NaN,Accepted
9,18.0,Male,53.0,98.98,Rejected
10,17.0,Male,78.0,NaN,Rejected
11,18.0,Male,89.0,NaN,Accepted
12,19.0,Male,66.0,88.17,NaN
13,21.0,Male,62.0,79.03,Accepted
14,22.0,Male,86.0,50.77,Rejected
15,19.0,Male,84.0,97.19,Rejected
16,NaN,Male,61.0,74.08,Rejected
17,17.0,Female,96.0,93.34,Rejected
18,19.0,Female,74.0,70.26,Accepted
19,19.0,Male,84.0,NaN,Rejected
20,22.0,Male,77.0,94.02,Rejected
21,NaN,Female,79.0,73.23,Rejected
23,-1.0,Male,NaN,54.59,NaN
24,21.0,Male,82.0,97.21,Rejected
25,18.0,Male,NaN,NaN,Rejected
26,20.0,Female,76.0,69.27,Rejected